In [62]:
import pandas as pd
import numpy as np

In [2]:
sample_pd_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print(sample_pd_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [5]:
sample_pd_index_data = pd.Series([0,10,20,30,40,50,60,70,80,90],
                                index=['a','b','c','d','e','f','g','h','i','j'])
print(sample_pd_index_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [8]:
print('인덱스 값 : ', sample_pd_index_data.index)

인덱스 값 :  Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [13]:
attri_data1 = {'ID':['100','101','102','103','104'],
                     'City':['Seoul','Pusan','Daegi','Gananeung','Seoul'],
                    'Birth_year':[1990,1989,1992,1997,1982],
                     'Name':['Junho','Heejin','Mijung','Minho','Steve']}
attri_data_frame1 = pd.DataFrame(attri_data1)

print(attri_data_frame1)

    ID       City  Birth_year    Name
0  100      Seoul        1990   Junho
1  101      Pusan        1989  Heejin
2  102      Daegi        1992  Mijung
3  103  Gananeung        1997   Minho
4  104      Seoul        1982   Steve

In [31]:
attri_data_frame_index1 = pd.DataFrame(attri_data1, index=['a','b','c','d','e'])
attri_data_frame1[attri_data_frame1['Birth_year'] > 1990]

    ID       City  Birth_year    Name
2  102      Daegi        1992  Mijung
3  103  Gananeung        1997   Minho

In [34]:
attri_data_frame1.drop(['Birth_year'], axis=1)

    ID       City    Name
0  100      Seoul   Junho
1  101      Pusan  Heejin
2  102      Daegi  Mijung
3  103  Gananeung   Minho
4  104      Seoul   Steve

In [40]:
attri_data2 = {'ID':['100','101','102','105','107'],
                     'Math':[50,43,33,76,98],
                    'English':[90,30,20,50,30],
                     'Sex':['M','F','F','M','M']}
attri_data_frame2 = pd.DataFrame(attri_data2)
attri_data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [41]:
pd.merge(attri_data_frame1,attri_data_frame2)

    ID   City  Birth_year    Name  Math  English Sex
0  100  Seoul        1990   Junho    50       90   M
1  101  Pusan        1989  Heejin    43       30   F
2  102  Daegi        1992  Mijung    33       20   F

In [45]:
attri_data_frame2.groupby('Sex')['English'].max()

Sex
F    30
M    90
Name: English, dtype: int64

In [47]:
attri_data2 = {'ID':['100','101','102','103','104'],
                     'City':['Seoul','Pusan','Daegu','Gananeung','Seoul'],
                    'Birth_year':[1990,1989,1992,1997,1982],
                     'Name':['Junho','Heejin','Mijung','Minho','Steve']}
attri_data_frame2 = pd.DataFrame(attri_data2)
attri_data_frame_index2 = pd.DataFrame(attri_data2,index=['e','b','a','d','c'])
attri_data_frame_index2

    ID       City  Birth_year    Name
e  100      Seoul        1990   Junho
b  101      Pusan        1989  Heejin
a  102      Daegu        1992  Mijung
d  103  Gananeung        1997   Minho
c  104      Seoul        1982   Steve

In [55]:
attri_data_frame_index2.sort_index()

    ID       City  Birth_year    Name
a  102      Daegu        1992  Mijung
b  101      Pusan        1989  Heejin
c  104      Seoul        1982   Steve
d  103  Gananeung        1997   Minho
e  100      Seoul        1990   Junho

In [58]:
attri_data_frame_index2.isin(['Seoul'])

      ID   City  Birth_year   Name
e  False   True       False  False
b  False  False       False  False
a  False  False       False  False
d  False  False       False  False
c  False   True       False  False

In [63]:
attri_data_frame_index2['Name'] = np.nan

In [67]:
attri_data_frame_index2.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64

In [69]:
attri_data1 = {'ID':['1','2','3','4','5'],
              'Sex':['F','F','M','M','F'],
              'Money':[1000,2000,500,300,700],
              'Name':['Suji','Minji','Taeho','Jinsung','Suyoung']}
attri_data_frame1 = pd.DataFrame(attri_data1)

In [70]:
attri_data_frame1[attri_data_frame1['Money'] > 500]

  ID Sex  Money     Name
0  1   F   1000     Suji
1  2   F   2000    Minji
4  5   F    700  Suyoung

In [72]:
attri_data_frame1.groupby('Sex')['Money'].mean()

Sex
F    1233.333333
M     400.000000
Name: Money, dtype: float64

In [73]:
attri_data2 = {'ID':['3','4','7'],
              'Math':[60,30,40],
              'English':[80,20,30]}
attri_data_frame2 = pd.DataFrame(attri_data2)

In [83]:
attri_data_frame = pd.merge(attri_data_frame1, attri_data_frame2)

In [90]:
attri_data_frame['Math'].mean()

45.0